***messages***

; WinRAR 7.20 日本語翻訳

:STRINGS

IDS_UNINSTTITLE                "WinRAR アーカイバ"
IDS_WINRARHELP                 "WinRAR ヘルプ"
IDS_RARHELP                    "コンソール RAR マニュアル"
IDS_WHATSNEW                   "新機能"

; Name of WhatsNew.txt file in distribution package.
; Edit it only if you renamed this file.
IDS_WHATSNEWNAME               "WhatsNew.txt"

IDS_UNINSTALLRAR               "WinRAR のアンインストール"
IDS_UNINSTALLCOMPLETED         "アンインストールが完了しました"
IDS_UNINSTALLSHOULDDELETE      "%s は手動で削除してください"
IDS_SETTINGSWARN               "管理や圧縮プロファイルに保存されているパスワードを含むすべての設定は、事前にエクスポートしない限り失われます。"
IDS_CONTINUEUNINSTALL          "WinRAR のアンインストールを続けますか ?"
IDS_CANNOTOPENLIST             "リストファイル %s を開けません"
IDS_WINRARARC                  "WinRAR 書庫"
IDS_WINRARZIPARC               "WinRAR ZIP 書庫"
IDS_RARRECVOL                  "RAR リカバリボリューム"
IDS_HOMEURL                    "https://www.winrarjapan.com"
IDS_WINRARDESC                 "RAR、 ZIP および他の書庫形式を処理"
IDS_REBOOTREQUIRED             "WinRAR のアンインストールを完了するには、 Windows を再起動する必要があります。"
IDS_INSTHELP1                  "ここでは WinRAR を Windows に統合するための制御をします。"
IDS_INSTHELP2                  "最初のグループでは、 WinRAR が扱う書庫の種類を選択します。"
IDS_INSTHELP3                  "2 番目のグループでは、 WinRAR の実行ファイルへのリンクを作成する場所を選択します。"
IDS_INSTHELP4                  "最後のグループでは、 Windows シェルと統合について選択します。"
IDS_INSTHELP5                  "シェルへの統合は便利な機能「解凍」を書庫のコンテキストメニューに追加します。 通常この機能を無効にする理由はありません。"
IDS_INSTHELP6                  "各オプションの詳細は「ヘルプ」ボタンでご確認ください。"
IDS_WARN32BIT                  "64 ビット版 Windows に 32 ビット版の WinRAR がインストールされています。より良いパフォーマンスとシェル統合のために、32 ビット版 WinRAR をアンインストールし、64 ビット版 のWinRAR をインストールすることをお勧めします。"
IDS_INSTREBOOTREQUIRED         "コンピュータを再起動して、インストールを完了してください。"
IDS_BETA                       "ベータ"
IDS_32BIT                      "32-bit"
IDS_64BIT                      "64-bit"
IDS_SINGLETOPITEM              "コンテキストメニューのサブメニューがオフの場合、1 つのメニュー項目しか表示されません。この項目は、\"コンテキストメニュー項目...\" からカスタマイズできます。"
IDS_INSTINFOFOLDER             "WinRAR のインストールに成功しました。"

; Displayed beginning from Windows 11.
IDS_INSTINFOASSOCIATE          "Windows で書庫を開き、表示されるプロンプトで WinRAR を ｢常に使う」よう選択し、書庫形式との関連付けを設定する必要がある場合があります。"

IDS_INSTINFOSETTINGS           "「オプション」メニューの「設定」コマンドを使って WinRAR をカスタマイズすることができます。"
IDS_INSTINFOPURCHASE           "WinRAR はフリーソフトではありません。ライセンスを購入していただくことによってのみ弊社は改良を続けより良い製品を提供することが可能となります。"
IDS_INSTINFODOWNLOAD           "最新版の WinRAR は WinRAR ホームページからダウンロードできます。また同ページで WinRAR のライセンスを安全にオンライン購入することもできます。"


:DIALOG SETUPDLG

SIZE                           "100*100"
CAPTION                        "WinRAR セットアップ"
IDC_ASSOCWITH                  "WinRAR に関連付け"
IDC_ASSOCRAR                   "&RAR"
IDC_ASSOCZIP                   "&ZIP"
IDC_ASSOC7Z                    "7Z"
IDC_ASSOCARJ                   "ARJ"
IDC_ASSOCBZ2                   "BZ2"
IDC_ASSOCCAB                   "CAB"
IDC_ASSOCGZ                    "GZ"
IDC_ASSOCISO                   "ISO"
IDC_ASSOCJAR                   "JAR"
IDC_ASSOCLZ                    "LZ"
IDC_ASSOCLZH                   "LZH"
IDC_ASSOCTAR                   "TAR"
IDC_ASSOCUUE                   "UUE"
IDC_ASSOCXZ                    "XZ"
IDC_ASSOCZ                     "Z"
IDC_ASSOCZIPX                  "ZIPX"
IDC_ASSOCZST                   "ZST"
IDC_ASSOC001                   "001"
IDC_ASSOCALL                   "すべて選択/解除(&A)"
IDC_INTEGRATIONINTERFACE       "インターフェース"
IDC_LINKDESKTOP                "デスクトップにショートカットを作成(&D)"
IDC_LINKSTARTMENU              "WinRAR をスタートメニューに追加(&S)"
IDC_LINKPROGRAMS               "WinRAR のプログラムグループを作成(&P)"
IDC_SHELLINTEGRATION           "シェル統合"
IDC_SHELLEXT                   "WinRAR をシェルに統合する(&I)"
IDC_SHELLCASCADED              "サブメニューにする(&T)"
IDC_SHELLICONS                 "コンテキストメニューにアイコンを表示する(&N)"
IDC_SHELLLEGACYMENU            "レガシーコンテキストメニューを使用する(&L)"
IDC_SETCONTEXTMENU             "コンテキストメニュー項目(&C)..."
IDOK                           "OK"
IDHELP                         "ヘルプ"


:DIALOG DONEDLG

SIZE                           "100*100"
CAPTION                        "WinRAR セットアップ"
IDOK                           "完了"
IDC_WHATSNEW                   "新機能(&W)"
IDC_RUNWINRAR                  "WinRAR を実行(&R)"
IDC_VIEWHELP                   "ヘルプ(&H)"
IDC_VIEWLICENSE                "ライセンス(&L)"
IDC_VIEWPRICE                  "購入(&O)"
IDC_HOMEPAGE                   "ホームページ(&M)"
IDC_THANKS                     "WinRAR をご利用いただきありがとうございます!"


:DIALOG SETUPCONTEXTITEMS

SIZE                           "100*100"
CAPTION                        "コンテキストメニューの項目"
IDC_CONTEXTMENUITEMS           "エクスプローラーのコンテキストメニューに表示する項目の選択"
IDC_CONTEXTEXTRACTTO           "解凍(&A)..."
IDC_CONTEXTEXTRACTHERE         "ここに解凍(&X)"
IDC_CONTEXTEXTRACT             "<フォルダー\\> に解凍(&E)"
IDC_CONTEXTEXTRACTSEPARATE     "書庫ごとにサブフォルダーに解凍(&S)"
IDC_CONTEXTOPENSFX             "WinRAR で開く (自己解凍書庫)"
IDC_CONTEXTOPENARC             "WinRAR で開く (通常書庫)"
IDC_CONTEXTADD                 "書庫に圧縮(&A)..."
IDC_CONTEXTADDARC              "<書庫名> に圧縮(&T)"
IDC_CONTEXTEMAILARC            "<書庫名> に圧縮してメール送信"
IDC_CONTEXTEMAILARCOPT         "圧縮してメール送信..."
IDC_CONTEXTTEST                "書庫をテスト(&R)"
IDC_CONTEXTCONVERT             "書庫を変換(&V)..."

; Positions of IDC_CONTEXTTOP* controls are overlapping with IDC_CONTEXT*.
; WinRAR hides either one or another group depending on other options.
IDC_CONTEXTTOPEXTRACT          "<フォルダー\\> に解凍(&E)"
IDC_CONTEXTTOPEXTRACTTO        "解凍(&A)..."
IDC_CONTEXTTOPEXTRACTHERE      "ここに解凍(&X)"
IDC_CONTEXTTOPEXTRACTSEPARATE  "書庫ごとにサブフォルダーに解凍(&S)"
IDC_CONTEXTTOPADDARC           "<書庫名> に圧縮(&T)"
IDC_CONTEXTTOPADD              "書庫に圧縮(&A)..."

IDC_CONTEXTNEWMENU             "「新規作成」サブメニュー項目"
IDC_CONTEXTNEWRAR              "WinRAR 書庫"
IDC_CONTEXTNEWZIP              "WinRAR ZIP 書庫"
IDC_CONTEXTDROPMENU            "コンテキストメニューをドラッグ&ドロップ"
IDC_CONTEXTDRAGADD             "圧縮する項目を表示(&H)"
IDC_CONTEXTDRAGEXTRACT         "解凍する項目を表示(&C)"
IDC_CONTEXTSFXARCHIVES         "自己解凍書庫をチェックする場所"
IDC_CONTEXTSFXCLOUD            "クラウドファイル(&U)"
IDC_CONTEXTSFXLOCAL            "ローカルディスク(&L)"
IDC_CONTEXTSFXNETWORK          "ネットワークディスク(&N)"
IDC_CONTEXTSFXOTHER            "その他のディスク(&O)"
IDC_CONTEXTALWAYSARCTITLE      "圧縮する項目を常に表示(&W)"
IDOK                           "OK"
IDCANCEL                       "キャンセル"
IDHELP                         "ヘルプ"
